[{
    "id": 1,
    "description": "On the eve of his 111th birthday Frodo's Uncle Bilbo leaves the Shire to retire and live out the last of his life in Rivendel with the elves. Upon leaving Bilbo leaves his home on Bag End and everything in it to Frodo. This inheretence included a ring with magical properties that is discovered to be the Ring of Power created by the dark lord Sauron to power over all."
}, {
    "id": 2,
    "description": "After discovering the true nature of the ring Gandalf send Frodo away from the Shire to Rivendel to seek safety from those who are looking to return the Ring of Power to the dark lord Sauron."
}, {
    "id": 3,
    "description": "In Rivendel a counsel is held between the rulers of the kingdoms of men, elves, and dwarves to decide what should be done with the Ring. It is decided that it needs to be destroyed in order to protect the future of Middle Earth. Frodo volunteers to carry the ring to Mt. Doom to throw it into the fires of the mountain where it was made in order to destroy it. He is joined by eight others, Gandalf, Aragorn, Legolas, Gimli, Boromir, and three other hobbits, Sam, Merry and Pippin. This band of people were called the Fellowship of the Ring."
}, {
    "id": 4,
    "description": "During the travels of the Fellowship, Boromir tries to take the Ring from Frodo for himself and his people. Frodo decides to leave the Fellowship and travel on his own to Mordor to destroy the Ring. His faithful servent Sam follows with him. Orcs attack the Fellowship Boromir is killed trying to protect the other hobbits who are taken captive. After the attack Aragorn, Legolas and Gimli track the orcs to try and save Merry and Pippin form the Orcs. Thus ending the Fellowship of the Ring."
}, {
    "id": 5,
    "description": "During Merry and Pippin's travel with the orcs to Isengaurd they are attacked by a group of men called the Rohirrim.  During the attack Merry and Pippin are able to sneak away and escape their captivity. They escape into Fangorn Forest where they are taken care of by Tree Beard an ent who helps them fight againts the evil powers at Isengaurd after which Aragorn, Legolas, Gimli and Gandalf finally track then down and rejoin them in the fight agains the evils of Middle Earth."
}, {
    "id": 6,
    "description": "After joining up at Isengaurd Gandalf, Aragorn, Legolas, Gimli and the two hobbits journey to Rohan where Pippin looks into a magic seers orb called the Palantir in it he sees the dark lord Sauron who asked him questions and is lead to believe that Pippin is the hobbit who is in posession of the Ring."
}, {
    "id": 7,
    "description": "To protect pippin and warn the men of gondor of what is to come Gandalf and Pippin leave Rohan and ride to the capitol of Gondor, Minas Tirith."
}, {
    "id": 8,
    "description": "Frodo and Sam capture the creature Gollum on their travels who promises to show them a way into Mordor so Gollum leads them to a secret entrance passing by Minas Morgul the home of the Witch King of Angmar where suaron is gathering his armies to march on Minas Tirith. Once they pass Minas Morgul they climb a winding stair"
}, {
    "id": 9,
    "description": "After reaching Minas Tirith Gandalf and Pippin warn the Steward of Gondorof the impending doom ahead and sneakily call on the aide of the men of Rohan. The King of Rohan rides with all of his Rohirrim and Aragorn, Legolas, and Gimili to help Gondor fight the Orcs of Mordor. On the way Aragorn, Legolas and Gimli divert off the path to call for more help for the battle. Aragorn being the true king of Gondor had the ability to call on the army of the dead who owe a debt to the true king of Gondor."
}, {
    "id": 10,
    "description": "The Orcs of Mordor march on Gondor and begin to attack the white city"
}, {
    "id": 11,
    "description": "A long battle commences between men and orc the rohirrim arrive and help to fight the orcs. Aragorn, Legolas, and Gimli also arrive to assist in the battle with the help of the army of the dead and together they are all able to push the orcs away from Gondor."
}, {
    "id": 12,
    "description": "Frodo and Sam reach the top of the winding stair and enter the lair of a giant spider named Shelob who attacks Frodo. Sam thinking him dead takes the Ring and tries to finish the job of destroying the ring buy finds out that Frodo is only knocked unconscious by the spiders venom. Sam then saves Frodo from some orcs and they use orc armor to disguise themselves and sneak into Mordor."
}, { 
    "id": 13,
    "description": "After winning the battle at Gondor the Aragorn resigns to take up his true duty as king of Gondor"
}, {
    "id": 14,
    "description": "Aragorn marches whats left of his armies to the Blackgate, the main entrance of Mordor to capture the attention of Sauron to give Frodo the best chance of crossing the plains of Mordor without being noticed by Sauron and being caught."
}, {
    "id": 15,
    "description": "Frodo and Sam carefully cross the plains of Mordor avoiding the gaze of the great eye of Sauron. They are able to make it to the base of Mt. Doom before Gollum catches up to them and tries to take the Ring from Frodo"
}, {
    "id": 16,
    "description": "While struggling to keep the Ring from Gollum Frodo and Gollum make their way into Mt. Doom where they contuinue to stuggle over the Ring. Gollum bites off Frodos finger to take the ring and then slips and falls into the fires of Mt. Doom destroying the ring."
}]
